export default {
  navigationTabs: {
    homeScreen: 'الدراسة',
    discussionScreen: 'المجتمع',
    examScreen: 'الاختبارات',
    moreScreen: 'المزيد',
  },
  // قسم لغة شاشة تسجيل الدخول
  loginScreen: {
    pageTitle: 'دخول البوابة',
    universityIDInputPlaceholder: 'الرقم الجامعى',
    passwordInputPlaceholder: 'كلمةالمرور',
    forgotLink: 'نسيت كلمة المرور ؟',
    loginButton: 'تسجيل الدخول',
    signInLoadingText: 'جاري تسجيل الدخول',
  },
  AnnouncementScreen: {
    pageTitle: `التأكد من رفع مقاطع الفيديو` + `\nللامتحانات النهائية`,
    MessageText:
      `حرصًا من الإدارة على مصلحة طلابها الأفاضل، وللتأكد من أنه ليس لديك فيديوهات غير مرفوعة حتى الآن خاصة بالامتحانات النهائية، يرجى اتباع الخطوات الآتية:` +
      `\nفتح برنامج الاختبارات بدون إدخال اسم المستخدم أو كلمة المرور.` +
      `\nإذا لم تظهر لك رسالة بأن لديك فيديوهات غير مرفوعة فهذا يعني أنك غير مطالب بأي إجراء، وبالتالي عليك تجاهل هذه الرسالة.` +
      `\nإذا ظهر لك رسالة نصها (... فيديوهات غير مرفوعة) مسبوقة برقم، فهذا يعني أن لديك عدد من الفيديوهات لم يتم رفعه حسب الرقم المذكور في بداية الرسالة، وبالتالي مطلوب منك:` +
      `\nالضغط على زر (ارفع الآن).` +
      `\nإبقاء البرنامج مفتوحًا لحين الانتهاء من الرفع بنجاح.` +
      `\nيظهر لك أثناء الرفع مؤشر يوضح نسبة ما تم رفعه والنسبة المتبقية.` +
      `\nينبغي التأكد من اتصالك بالإنترنت وأن الشبكة تعمل بشكل جيد.`,
    ButtonText: `حسنا قرات الإعلان`,
  },
  HomeScreen: {
    TitleHeader: `اللقاء القادم`,
  },
  loadingScreen: {
    loadingText: 'جار التحميل....',
  },
  errorMessage: {
    offline: 'أنت حاليا غير متصل',
  },
};
